In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['arshaq', 'bilal', 'hashir', 'ahmed'],
    "marks":[91, 92, 75, 83],
    "city":['islamabad', 'karachi', 'peshawar', 'multan'],    
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0  arshaq     91  islamabad
1   bilal     92    karachi
2  hashir     75   peshawar
3   ahmed     83     multan

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_without_index.csv', index=False)

In [7]:
df.head(2)

     name  marks       city
0  arshaq     91  islamabad
1   bilal     92    karachi

In [8]:
df.tail(2)

     name  marks      city
2  hashir     75  peshawar
3   ahmed     83    multan

In [9]:
df.describe()

           marks
count   4.000000
mean   85.250000
std     7.932003
min    75.000000
25%    81.000000
50%    87.000000
75%    91.250000
max    92.000000

In [10]:
train = pd.read_csv('train.csv')

In [11]:
train

   Unnamed: 0.1  Unnamed: 0  Train No  Speed       city
0             0           0       122     50  islamabad
1             1           1      1243     92    karachi
2             2           2     21344     75   peshawar
3             3           3      2134     75     multan

In [12]:
train['Speed'][0] = 50

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7480\185416197.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  train['Speed'][0] = 50
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7480\185416197.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0] = 50

In [13]:
train

   Unnamed: 0.1  Unnamed: 0  Train No  Speed       city
0             0           0       122     50  islamabad
1             1           1      1243     92    karachi
2             2           2     21344     75   peshawar
3             3           3      2134     75     multan

In [14]:
train.to_csv('train.csv')

In [15]:
train.index = ['first', 'second', 'third', 'fourth']

In [16]:
train

        Unnamed: 0.1  Unnamed: 0  Train No  Speed       city
first              0           0       122     50  islamabad
second             1           1      1243     92    karachi
third              2           2     21344     75   peshawar
fourth             3           3      2134     75     multan

### Pandas has two types of data structures:

1. Series: one dimensional array with indexes, single column or row of data in a Dataframe, holds any one type of data.
2. Dataframe: tabular spreadsheet like structure representing rows each of which contains one or multiple columns

In [17]:
ser = pd.Series(np.random.random(34))

In [18]:
type(ser)

pandas.core.series.Series

In [19]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [20]:
newdf.head()

          0         1         2         3         4
0  0.917135  0.243733  0.088733  0.976451  0.677271
1  0.134767  0.943542  0.359431  0.604892  0.866648
2  0.939122  0.246079  0.521721  0.485487  0.656053
3  0.641410  0.067848  0.931008  0.875706  0.039951
4  0.893131  0.874304  0.169301  0.065242  0.537501

In [21]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.504548    0.473971    0.524416    0.498543    0.498698
std      0.286882    0.287763    0.289940    0.291532    0.288781
min      0.014323    0.008947    0.000305    0.000810    0.000003
25%      0.248107    0.241177    0.289161    0.246955    0.251073
50%      0.515175    0.434762    0.534445    0.506665    0.498131
75%      0.748787    0.733323    0.785151    0.737161    0.753169
max      0.998514    0.997208    0.998199    0.996744    0.999143

In [22]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
newdf[0][0] = 0.3

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7480\417204169.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = 0.3

In [24]:
newdf.head()

          0         1         2         3         4
0  0.300000  0.243733  0.088733  0.976451  0.677271
1  0.134767  0.943542  0.359431  0.604892  0.866648
2  0.939122  0.246079  0.521721  0.485487  0.656053
3  0.641410  0.067848  0.931008  0.875706  0.039951
4  0.893131  0.874304  0.169301  0.065242  0.537501

In [25]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [26]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [27]:
newdf.to_numpy()

array([[0.3       , 0.24373291, 0.08873348, 0.97645136, 0.67727056],
       [0.13476726, 0.94354166, 0.35943131, 0.60489156, 0.86664835],
       [0.93912245, 0.24607874, 0.52172071, 0.48548692, 0.65605258],
       ...,
       [0.92531907, 0.13687065, 0.64164036, 0.529305  , 0.10682859],
       [0.75068597, 0.24065045, 0.23885881, 0.41031339, 0.54823796],
       [0.83829077, 0.94298631, 0.30672338, 0.31072815, 0.90014667]])

In [28]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.300000,0.134767,0.939122,0.641410,0.893131,0.095700,0.818144,0.632003,0.641868,0.155168,...,0.172237,0.434794,0.173233,0.422223,0.117658,0.856162,0.792295,0.925319,0.750686,0.838291
1,0.243733,0.943542,0.246079,0.067848,0.874304,0.961324,0.572097,0.512069,0.244194,0.814673,...,0.530222,0.343061,0.961547,0.435432,0.131890,0.199351,0.435106,0.136871,0.240650,0.942986
2,0.088733,0.359431,0.521721,0.931008,0.169301,0.931505,0.815092,0.917905,0.847729,0.587704,...,0.293544,0.733836,0.454414,0.603547,0.459855,0.755057,0.191961,0.641640,0.238859,0.306723
3,0.976451,0.604892,0.485487,0.875706,0.065242,0.094892,0.896544,0.798898,0.798702,0.993674,...,0.081167,0.414479,0.397296,0.815504,0.693250,0.635479,0.377920,0.529305,0.410313,0.310728
4,0.677271,0.866648,0.656053,0.039951,0.537501,0.927780,0.229240,0.913911,0.259756,0.382462,...,0.392761,0.662013,0.132553,0.121978,0.909877,0.840064,0.757304,0.106829,0.548238,0.900147

In [29]:
newdf.head()

          0         1         2         3         4
0  0.300000  0.243733  0.088733  0.976451  0.677271
1  0.134767  0.943542  0.359431  0.604892  0.866648
2  0.939122  0.246079  0.521721  0.485487  0.656053
3  0.641410  0.067848  0.931008  0.875706  0.039951
4  0.893131  0.874304  0.169301  0.065242  0.537501

In [30]:
newdf.sort_index(axis=0, ascending=False).head()

            0         1         2         3         4
333  0.838291  0.942986  0.306723  0.310728  0.900147
332  0.750686  0.240650  0.238859  0.410313  0.548238
331  0.925319  0.136871  0.641640  0.529305  0.106829
330  0.792295  0.435106  0.191961  0.377920  0.757304
329  0.856162  0.199351  0.755057  0.635479  0.840064

In [31]:
newdf.sort_index(axis=1, ascending=False).head()

          4         3         2         1         0
0  0.677271  0.976451  0.088733  0.243733  0.300000
1  0.866648  0.604892  0.359431  0.943542  0.134767
2  0.656053  0.485487  0.521721  0.246079  0.939122
3  0.039951  0.875706  0.931008  0.067848  0.641410
4  0.537501  0.065242  0.169301  0.874304  0.893131

In [32]:
type(newdf[0])

pandas.core.series.Series

In [33]:
newdf.head()

          0         1         2         3         4
0  0.300000  0.243733  0.088733  0.976451  0.677271
1  0.134767  0.943542  0.359431  0.604892  0.866648
2  0.939122  0.246079  0.521721  0.485487  0.656053
3  0.641410  0.067848  0.931008  0.875706  0.039951
4  0.893131  0.874304  0.169301  0.065242  0.537501

In [34]:
newdf2 = newdf       #pointer to newdf, not another copy, it just points to the same memory location that has newdf

In [35]:
newdf2[0][0] = 4942

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7480\1726519269.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0] = 4942

In [36]:
newdf

               0         1         2         3         4
0    4942.000000  0.243733  0.088733  0.976451  0.677271
1       0.134767  0.943542  0.359431  0.604892  0.866648
2       0.939122  0.246079  0.521721  0.485487  0.656053
3       0.641410  0.067848  0.931008  0.875706  0.039951
4       0.893131  0.874304  0.169301  0.065242  0.537501
..           ...       ...       ...       ...       ...
329     0.856162  0.199351  0.755057  0.635479  0.840064
330     0.792295  0.435106  0.191961  0.377920  0.757304
331     0.925319  0.136871  0.641640  0.529305  0.106829
332     0.750686  0.240650  0.238859  0.410313  0.548238
333     0.838291  0.942986  0.306723  0.310728  0.900147

[334 rows x 5 columns]

In [37]:
newdf2 = newdf[:]         #makes a seperate copy of newdf and stores it in newdf2

In [38]:
newdf2 = newdf.copy()     #makes a seperate copy of newdf and stores it in newdf2

In [39]:
newdf2[0][0] = 21321

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7480\461067651.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0] = 21321

In [40]:
newdf

               0         1         2         3         4
0    4942.000000  0.243733  0.088733  0.976451  0.677271
1       0.134767  0.943542  0.359431  0.604892  0.866648
2       0.939122  0.246079  0.521721  0.485487  0.656053
3       0.641410  0.067848  0.931008  0.875706  0.039951
4       0.893131  0.874304  0.169301  0.065242  0.537501
..           ...       ...       ...       ...       ...
329     0.856162  0.199351  0.755057  0.635479  0.840064
330     0.792295  0.435106  0.191961  0.377920  0.757304
331     0.925319  0.136871  0.641640  0.529305  0.106829
332     0.750686  0.240650  0.238859  0.410313  0.548238
333     0.838291  0.942986  0.306723  0.310728  0.900147

[334 rows x 5 columns]

In [41]:
newdf2

                0         1         2         3         4
0    21321.000000  0.243733  0.088733  0.976451  0.677271
1        0.134767  0.943542  0.359431  0.604892  0.866648
2        0.939122  0.246079  0.521721  0.485487  0.656053
3        0.641410  0.067848  0.931008  0.875706  0.039951
4        0.893131  0.874304  0.169301  0.065242  0.537501
..            ...       ...       ...       ...       ...
329      0.856162  0.199351  0.755057  0.635479  0.840064
330      0.792295  0.435106  0.191961  0.377920  0.757304
331      0.925319  0.136871  0.641640  0.529305  0.106829
332      0.750686  0.240650  0.238859  0.410313  0.548238
333      0.838291  0.942986  0.306723  0.310728  0.900147

[334 rows x 5 columns]

In [42]:
newdf.head(2)

             0         1         2         3         4
0  4942.000000  0.243733  0.088733  0.976451  0.677271
1     0.134767  0.943542  0.359431  0.604892  0.866648

In [43]:
newdf.columns = list("ABCDE")

In [44]:
newdf.head(2)

             A         B         C         D         E
0  4942.000000  0.243733  0.088733  0.976451  0.677271
1     0.134767  0.943542  0.359431  0.604892  0.866648

In [45]:
newdf.loc[0,'A'] = 3425

In [46]:
newdf

               A         B         C         D         E
0    3425.000000  0.243733  0.088733  0.976451  0.677271
1       0.134767  0.943542  0.359431  0.604892  0.866648
2       0.939122  0.246079  0.521721  0.485487  0.656053
3       0.641410  0.067848  0.931008  0.875706  0.039951
4       0.893131  0.874304  0.169301  0.065242  0.537501
..           ...       ...       ...       ...       ...
329     0.856162  0.199351  0.755057  0.635479  0.840064
330     0.792295  0.435106  0.191961  0.377920  0.757304
331     0.925319  0.136871  0.641640  0.529305  0.106829
332     0.750686  0.240650  0.238859  0.410313  0.548238
333     0.838291  0.942986  0.306723  0.310728  0.900147

[334 rows x 5 columns]

In [47]:
newdf.loc[0,'A'] = 8424

In [48]:
newdf.head(2)

             A         B         C         D         E
0  8424.000000  0.243733  0.088733  0.976451  0.677271
1     0.134767  0.943542  0.359431  0.604892  0.866648

In [49]:
newdf.loc[[1,2], ['C', 'D']]

          C         D
1  0.359431  0.604892
2  0.521721  0.485487

In [50]:
newdf.loc[:, ['C', 'D']]

            C         D
0    0.088733  0.976451
1    0.359431  0.604892
2    0.521721  0.485487
3    0.931008  0.875706
4    0.169301  0.065242
..        ...       ...
329  0.755057  0.635479
330  0.191961  0.377920
331  0.641640  0.529305
332  0.238859  0.410313
333  0.306723  0.310728

[334 rows x 2 columns]

In [51]:
newdf.loc[[1,2], :]

          A         B         C         D         E
1  0.134767  0.943542  0.359431  0.604892  0.866648
2  0.939122  0.246079  0.521721  0.485487  0.656053

In [52]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
1    0.134767  0.943542  0.359431  0.604892  0.866648
5    0.095700  0.961324  0.931505  0.094892  0.927780
9    0.155168  0.814673  0.587704  0.993674  0.382462
13   0.197794  0.966449  0.888939  0.517768  0.265321
14   0.112150  0.721708  0.704061  0.388375  0.814549
..        ...       ...       ...       ...       ...
318  0.104912  0.534511  0.113318  0.334071  0.517790
323  0.273612  0.535298  0.321645  0.472553  0.078497
324  0.172237  0.530222  0.293544  0.081167  0.392761
326  0.173233  0.961547  0.454414  0.397296  0.132553
328  0.117658  0.131890  0.459855  0.693250  0.909877

[92 rows x 5 columns]

In [53]:
newdf.head(2)

             A         B         C         D         E
0  8424.000000  0.243733  0.088733  0.976451  0.677271
1     0.134767  0.943542  0.359431  0.604892  0.866648

In [54]:
newdf.loc[0,'E']

np.float64(0.6772705625214007)

In [55]:
newdf.iloc[0,4]

np.float64(0.6772705625214007)

In [56]:
newdf.iloc[[0,5],[1,2]]

          B         C
0  0.243733  0.088733
5  0.961324  0.931505

In [57]:
newdf.head(3)

             A         B         C         D         E
0  8424.000000  0.243733  0.088733  0.976451  0.677271
1     0.134767  0.943542  0.359431  0.604892  0.866648
2     0.939122  0.246079  0.521721  0.485487  0.656053

In [58]:
newdf.drop([0])

            A         B         C         D         E
1    0.134767  0.943542  0.359431  0.604892  0.866648
2    0.939122  0.246079  0.521721  0.485487  0.656053
3    0.641410  0.067848  0.931008  0.875706  0.039951
4    0.893131  0.874304  0.169301  0.065242  0.537501
5    0.095700  0.961324  0.931505  0.094892  0.927780
..        ...       ...       ...       ...       ...
329  0.856162  0.199351  0.755057  0.635479  0.840064
330  0.792295  0.435106  0.191961  0.377920  0.757304
331  0.925319  0.136871  0.641640  0.529305  0.106829
332  0.750686  0.240650  0.238859  0.410313  0.548238
333  0.838291  0.942986  0.306723  0.310728  0.900147

[333 rows x 5 columns]

In [59]:
newdf.drop([1,5], axis = 0, inplace = True)        #inplace modifies original dataframe

In [60]:
newdf

               A         B         C         D         E
0    8424.000000  0.243733  0.088733  0.976451  0.677271
2       0.939122  0.246079  0.521721  0.485487  0.656053
3       0.641410  0.067848  0.931008  0.875706  0.039951
4       0.893131  0.874304  0.169301  0.065242  0.537501
6       0.818144  0.572097  0.815092  0.896544  0.229240
..           ...       ...       ...       ...       ...
329     0.856162  0.199351  0.755057  0.635479  0.840064
330     0.792295  0.435106  0.191961  0.377920  0.757304
331     0.925319  0.136871  0.641640  0.529305  0.106829
332     0.750686  0.240650  0.238859  0.410313  0.548238
333     0.838291  0.942986  0.306723  0.310728  0.900147

[332 rows x 5 columns]

In [61]:
newdf.head(3)

             A         B         C         D         E
0  8424.000000  0.243733  0.088733  0.976451  0.677271
2     0.939122  0.246079  0.521721  0.485487  0.656053
3     0.641410  0.067848  0.931008  0.875706  0.039951

In [62]:
newdf.reset_index(drop = True, inplace = True)

In [63]:
newdf.head(3)

             A         B         C         D         E
0  8424.000000  0.243733  0.088733  0.976451  0.677271
1     0.939122  0.246079  0.521721  0.485487  0.656053
2     0.641410  0.067848  0.931008  0.875706  0.039951

In [64]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [65]:
newdf.loc[:, ['B']] = None

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7480\3025638253.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'None' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf.loc[:, ['B']] = None

In [66]:
newdf.iloc[np.arange(0,2), np.arange(0,2)] = 45

In [67]:
newdf

             A     B         C         D         E
0    45.000000    45  0.088733  0.976451  0.677271
1    45.000000    45  0.521721  0.485487  0.656053
2     0.641410  None  0.931008  0.875706  0.039951
3     0.893131  None  0.169301  0.065242  0.537501
4     0.818144  None  0.815092  0.896544  0.229240
..         ...   ...       ...       ...       ...
327   0.856162  None  0.755057  0.635479  0.840064
328   0.792295  None  0.191961  0.377920  0.757304
329   0.925319  None  0.641640  0.529305  0.106829
330   0.750686  None  0.238859  0.410313  0.548238
331   0.838291  None  0.306723  0.310728  0.900147

[332 rows x 5 columns]

In [68]:
newdf.loc[:, ['B', 'D']] = 56

In [69]:
newdf.head(4)

           A   B         C     D         E
0  45.000000  56  0.088733  56.0  0.677271
1  45.000000  56  0.521721  56.0  0.656053
2   0.641410  56  0.931008  56.0  0.039951
3   0.893131  56  0.169301  56.0  0.537501

In [70]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [71]:
df = pd.DataFrame(
    { "name": ['Alfred', 'Batman', 'Alfred'],
      "toy": [np.nan, 'Batmobile', 'Bullwhip'],  
      "born": [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]
    })

In [72]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [73]:
df.dropna(how='all', axis=1)

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [74]:
df.drop_duplicates(subset=['name'], keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [75]:
df.shape

(3, 3)

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [77]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [78]:
df['toy'].value_counts(dropna=False)

toy
NaN          1
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [79]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [80]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [81]:
data = pd.read_excel('data.xlsx', sheet_name='sheet1')

In [82]:
data

   Train No  Speed       city
0        21     98  islamabad
1        32     23    karachi
2        53     42   peshawar
3       435     54     multan

In [83]:
data.iloc[0,0] = 34

In [84]:
data

   Train No  Speed       city
0        34     98  islamabad
1        32     23    karachi
2        53     42   peshawar
3       435     54     multan

In [85]:
data2 = pd.read_excel('data.xlsx', sheet_name='sheet2')

In [86]:
data2

   Train Nos2  Speeds2     citys2
0          34       84  islamabad
1          52       32    karachi
2          87       98   peshawar
3         543       67     multan

In [87]:
with pd.ExcelWriter('output3.xlsx') as writer:
    data.to_excel(writer, sheet_name='sheet1')
    data2.to_excel(writer, sheet_name='sheet2')

In [88]:
#create a dataframe which contains only integers with 3 rows and 3 columns
#run following dataframe methods on them:

#describe(), mean(), corr(), count(), max(), min(), median(), std()

In [89]:
dict1 = {
    "id" : [10,20,30],
    "price" : [150, 275, 425],
    "discount" : [30, 15, 45] 
}

In [90]:
df = pd.DataFrame(dict1)

In [91]:
df

   id  price  discount
0  10    150        30
1  20    275        15
2  30    425        45

In [92]:
df.describe()

         id       price  discount
count   3.0    3.000000       3.0
mean   20.0  283.333333      30.0
std    10.0  137.689264      15.0
min    10.0  150.000000      15.0
25%    15.0  212.500000      22.5
50%    20.0  275.000000      30.0
75%    25.0  350.000000      37.5
max    30.0  425.000000      45.0

In [93]:
df.mean()

id           20.000000
price       283.333333
discount     30.000000
dtype: float64

In [94]:
df.corr()

                id     price  discount
id        1.000000  0.998625  0.500000
price     0.998625  1.000000  0.544705
discount  0.500000  0.544705  1.000000

In [95]:
df.loc[0,['price']] = 750

In [96]:
df

   id  price  discount
0  10    750        30
1  20    275        15
2  30    425        45

In [97]:
df.count()

id          3
price       3
discount    3
dtype: int64

In [98]:
df.max(axis=0)

id           30
price       750
discount     45
dtype: int64

In [99]:
df.median()

id           20.0
price       425.0
discount     30.0
dtype: float64

In [100]:
df.std()

id           10.000000
price       242.813371
discount     15.000000
dtype: float64

In [101]:
df

   id  price  discount
0  10    750        30
1  20    275        15
2  30    425        45

In [102]:
df.drop([1], axis=0)

   id  price  discount
0  10    750        30
2  30    425        45

In [103]:
df

   id  price  discount
0  10    750        30
1  20    275        15
2  30    425        45

In [104]:
df.drop([1], axis=0, inplace=True)

In [105]:
df

   id  price  discount
0  10    750        30
2  30    425        45

In [246]:
new_data = pd.read_csv('data.csv')

In [247]:
new_data

    Duration          Date  Pulse  Maxpulse  Calories
0         60  '2020/12/01'    110       130     409.1
1         60  '2020/12/02'    117       145     479.0
2         60  '2020/12/03'    103       135     340.0
3         45  '2020/12/04'    109       175     282.4
4         45  '2020/12/05'    117       148     406.0
5         60  '2020/12/06'    102       127     300.0
6         60  '2020/12/07'    110       136     374.0
7        450  '2020/12/08'    104       134     253.3
8         30  '2020/12/09'    109       133     195.1
9         60  '2020/12/10'     98       124     269.0
10        60  '2020/12/11'    103       147     329.3
11        60  '2020/12/12'    100       120     250.7
12        60  '2020/12/12'    100       120     250.7
13        60  '2020/12/13'    106       128     345.3
14        60  '2020/12/14'    104       132     379.3
15        60  '2020/12/15'     98       123     275.0
16        60  '2020/12/16'     98       120     215.2
17        60  '2020/12/17'    100       120     300.0
18        45  '2020/12/18'     90       112       NaN
19        60  '2020/12/19'    103       123     323.0
20        45  '2020/12/20'     97       125     243.0
21        60  '2020/12/21'    108       131     364.2
22        45           NaN    100       119     282.0
23        60  '2020/12/23'    130       101     300.0
24        45  '2020/12/24'    105       132     246.0
25        60  '2020/12/25'    102       126     334.5
26        60      20201226    100       120     250.0
27        60  '2020/12/27'     92       118     241.0
28        60  '2020/12/28'    103       132       NaN
29        60  '2020/12/29'    100       132     280.0
30        60  '2020/12/30'    102       129     380.3
31        60  '2020/12/31'     92       115     243.0

In [248]:
new_df = pd.DataFrame(new_data)

In [249]:
for x in new_df.index:
    if pd.isnull(new_df.loc[x, 'Calories']):
        new_df.loc[x, 'Calories'] = new_df['Calories'].mean()

In [250]:
new_df

    Duration          Date  Pulse  Maxpulse  Calories
0         60  '2020/12/01'    110       130    409.10
1         60  '2020/12/02'    117       145    479.00
2         60  '2020/12/03'    103       135    340.00
3         45  '2020/12/04'    109       175    282.40
4         45  '2020/12/05'    117       148    406.00
5         60  '2020/12/06'    102       127    300.00
6         60  '2020/12/07'    110       136    374.00
7        450  '2020/12/08'    104       134    253.30
8         30  '2020/12/09'    109       133    195.10
9         60  '2020/12/10'     98       124    269.00
10        60  '2020/12/11'    103       147    329.30
11        60  '2020/12/12'    100       120    250.70
12        60  '2020/12/12'    100       120    250.70
13        60  '2020/12/13'    106       128    345.30
14        60  '2020/12/14'    104       132    379.30
15        60  '2020/12/15'     98       123    275.00
16        60  '2020/12/16'     98       120    215.20
17        60  '2020/12/17'    100       120    300.00
18        45  '2020/12/18'     90       112    304.68
19        60  '2020/12/19'    103       123    323.00
20        45  '2020/12/20'     97       125    243.00
21        60  '2020/12/21'    108       131    364.20
22        45           NaN    100       119    282.00
23        60  '2020/12/23'    130       101    300.00
24        45  '2020/12/24'    105       132    246.00
25        60  '2020/12/25'    102       126    334.50
26        60      20201226    100       120    250.00
27        60  '2020/12/27'     92       118    241.00
28        60  '2020/12/28'    103       132    304.68
29        60  '2020/12/29'    100       132    280.00
30        60  '2020/12/30'    102       129    380.30
31        60  '2020/12/31'     92       115    243.00

In [251]:
new_df.dropna(inplace=True)
new_df

    Duration          Date  Pulse  Maxpulse  Calories
0         60  '2020/12/01'    110       130    409.10
1         60  '2020/12/02'    117       145    479.00
2         60  '2020/12/03'    103       135    340.00
3         45  '2020/12/04'    109       175    282.40
4         45  '2020/12/05'    117       148    406.00
5         60  '2020/12/06'    102       127    300.00
6         60  '2020/12/07'    110       136    374.00
7        450  '2020/12/08'    104       134    253.30
8         30  '2020/12/09'    109       133    195.10
9         60  '2020/12/10'     98       124    269.00
10        60  '2020/12/11'    103       147    329.30
11        60  '2020/12/12'    100       120    250.70
12        60  '2020/12/12'    100       120    250.70
13        60  '2020/12/13'    106       128    345.30
14        60  '2020/12/14'    104       132    379.30
15        60  '2020/12/15'     98       123    275.00
16        60  '2020/12/16'     98       120    215.20
17        60  '2020/12/17'    100       120    300.00
18        45  '2020/12/18'     90       112    304.68
19        60  '2020/12/19'    103       123    323.00
20        45  '2020/12/20'     97       125    243.00
21        60  '2020/12/21'    108       131    364.20
23        60  '2020/12/23'    130       101    300.00
24        45  '2020/12/24'    105       132    246.00
25        60  '2020/12/25'    102       126    334.50
26        60      20201226    100       120    250.00
27        60  '2020/12/27'     92       118    241.00
28        60  '2020/12/28'    103       132    304.68
29        60  '2020/12/29'    100       132    280.00
30        60  '2020/12/30'    102       129    380.30
31        60  '2020/12/31'     92       115    243.00

In [252]:
new_df['Date'] = pd.to_datetime(new_df['Date'], format='mixed')
new_df

    Duration       Date  Pulse  Maxpulse  Calories
0         60 2020-12-01    110       130    409.10
1         60 2020-12-02    117       145    479.00
2         60 2020-12-03    103       135    340.00
3         45 2020-12-04    109       175    282.40
4         45 2020-12-05    117       148    406.00
5         60 2020-12-06    102       127    300.00
6         60 2020-12-07    110       136    374.00
7        450 2020-12-08    104       134    253.30
8         30 2020-12-09    109       133    195.10
9         60 2020-12-10     98       124    269.00
10        60 2020-12-11    103       147    329.30
11        60 2020-12-12    100       120    250.70
12        60 2020-12-12    100       120    250.70
13        60 2020-12-13    106       128    345.30
14        60 2020-12-14    104       132    379.30
15        60 2020-12-15     98       123    275.00
16        60 2020-12-16     98       120    215.20
17        60 2020-12-17    100       120    300.00
18        45 2020-12-18     90       112    304.68
19        60 2020-12-19    103       123    323.00
20        45 2020-12-20     97       125    243.00
21        60 2020-12-21    108       131    364.20
23        60 2020-12-23    130       101    300.00
24        45 2020-12-24    105       132    246.00
25        60 2020-12-25    102       126    334.50
26        60 2020-12-26    100       120    250.00
27        60 2020-12-27     92       118    241.00
28        60 2020-12-28    103       132    304.68
29        60 2020-12-29    100       132    280.00
30        60 2020-12-30    102       129    380.30
31        60 2020-12-31     92       115    243.00

In [207]:
new_df.reset_index(drop=True)

    Duration          Date  Pulse  Maxpulse  Calories
0         60  '2020/12/01'    110       130     409.1
1         60  '2020/12/02'    117       145     479.0
2         60  '2020/12/03'    103       135     340.0
3         45  '2020/12/04'    109       175     282.4
4         45  '2020/12/05'    117       148     406.0
5         60  '2020/12/06'    102       127     300.0
6         60  '2020/12/07'    110       136     374.0
7        450  '2020/12/08'    104       134     253.3
8         30  '2020/12/09'    109       133     195.1
9         60  '2020/12/10'     98       124     269.0
10        60  '2020/12/11'    103       147     329.3
11        60  '2020/12/12'    100       120     250.7
12        60  '2020/12/12'    100       120     250.7
13        60  '2020/12/13'    106       128     345.3
14        60  '2020/12/14'    104       132     379.3
15        60  '2020/12/15'     98       123     275.0
16        60  '2020/12/16'     98       120     215.2
17        60  '2020/12/17'    100       120     300.0
18        60  '2020/12/19'    103       123     323.0
19        45  '2020/12/20'     97       125     243.0
20        60  '2020/12/21'    108       131     364.2
21        60  '2020/12/23'    130       101     300.0
22        45  '2020/12/24'    105       132     246.0
23        60  '2020/12/25'    102       126     334.5
24        60      20201226    100       120     250.0
25        60  '2020/12/27'     92       118     241.0
26        60  '2020/12/29'    100       132     280.0
27        60  '2020/12/30'    102       129     380.3
28        60  '2020/12/31'     92       115     243.0

In [208]:
new_df['Date'] = pd.to_datetime(new_df['Date'], format='mixed')

In [209]:
new_df.head(8)

   Duration       Date  Pulse  Maxpulse  Calories
0        60 2020-12-01    110       130     409.1
1        60 2020-12-02    117       145     479.0
2        60 2020-12-03    103       135     340.0
3        45 2020-12-04    109       175     282.4
4        45 2020-12-05    117       148     406.0
5        60 2020-12-06    102       127     300.0
6        60 2020-12-07    110       136     374.0
7       450 2020-12-08    104       134     253.3

In [210]:
for x in new_df.index:
    if new_df.loc[x,'Duration'] == 60:
        new_df.loc[x, 'Duration'] = int(new_df['Duration'].mean())

In [211]:
new_df.head(8)

   Duration       Date  Pulse  Maxpulse  Calories
0        70 2020-12-01    110       130     409.1
1        70 2020-12-02    117       145     479.0
2        71 2020-12-03    103       135     340.0
3        45 2020-12-04    109       175     282.4
4        45 2020-12-05    117       148     406.0
5        71 2020-12-06    102       127     300.0
6        71 2020-12-07    110       136     374.0
7       450 2020-12-08    104       134     253.3

In [212]:
new_df

    Duration       Date  Pulse  Maxpulse  Calories
0         70 2020-12-01    110       130     409.1
1         70 2020-12-02    117       145     479.0
2         71 2020-12-03    103       135     340.0
3         45 2020-12-04    109       175     282.4
4         45 2020-12-05    117       148     406.0
5         71 2020-12-06    102       127     300.0
6         71 2020-12-07    110       136     374.0
7        450 2020-12-08    104       134     253.3
8         30 2020-12-09    109       133     195.1
9         72 2020-12-10     98       124     269.0
10        72 2020-12-11    103       147     329.3
11        73 2020-12-12    100       120     250.7
12        73 2020-12-12    100       120     250.7
13        73 2020-12-13    106       128     345.3
14        74 2020-12-14    104       132     379.3
15        74 2020-12-15     98       123     275.0
16        75 2020-12-16     98       120     215.2
17        75 2020-12-17    100       120     300.0
19        76 2020-12-19    103       123     323.0
20        45 2020-12-20     97       125     243.0
21        76 2020-12-21    108       131     364.2
23        77 2020-12-23    130       101     300.0
24        45 2020-12-24    105       132     246.0
25        78 2020-12-25    102       126     334.5
26        78 2020-12-26    100       120     250.0
27        79 2020-12-27     92       118     241.0
29        79 2020-12-29    100       132     280.0
30        80 2020-12-30    102       129     380.3
31        81 2020-12-31     92       115     243.0